package com.saqtan.saqtan.data.model
/** хранит статьи из информационного раздела
 * */
data class HIVArticle(
    val header:String = "",
    val text:String = ""
)


val Articles:List<HIVArticle> = listOf(
    HIVArticle(
        header = "Аурудың анықтамасы",
        text = "АИТВ (адамның иммун тапшылығы вирусы) – жұқпалы созылмалы ауру, байланыс арқылы таралады, баяу үдемелі және жүре пайда болған иммун тапшылығы синдромының (ЖИТС) дамуымен иммундық жүйенің зақымдануымен сипатталады. ЖИТС-бұл АИТВ-инфекциясының соңғы кезеңі, иммундық жүйенің әлсіреуіне байланысты адам кез-келген инфекциядан және қатерлі ісіктің кейбір түрлерінен қорғансыз болады. Оппортунистік инфекциялар – патогенді немесе патогенді емес флора тудыратын аурулар: вирустар, бактериялар, саңырауқұлақтар, олар сау адамдарда ауыр зардаптарға әкелмейді немесе оңай өтеді және өздігінен емделеді. ЖИТС кезінде олар бір-бірінің үстіне қабаттасады, ұзаққа созылады, терапияға жақсы жауап қайтармайды және өлімге әкелуі мүмкін."
    ),
    HIVArticle(
        header = "АИТВ себептері",
        text = "Инфекция көзі-аурудың кез-келген кезеңінде АИТВ жұқтырған адам. Вирус қан, сперматозоидтар, қынаптың секретінен, емшек сүті арқылы беріледі.\n" +
                "Жыныстық жол (жұқтырған серіктеспен қорғалмаған жыныстық қатынас) АИТВ – инфекциясының таралуының басым факторы болып табылады.\n" +
                "АИТВ-ның анадан балаға берілуі жүктіліктің кез келген кезеңінде (плацента арқылы), босану кезінде (босану каналы арқылы өту кезінде) және емшек сүтімен (жаралар, ананың емізікшелерінде және баланың аузында жарықтар болған кезде) болуы мүмкін.\n" +
                "Инфекцияның жоғары қаупі стерильді емес шприцтермен есірткі заттарын көктамыр ішіне енгізгенде, АИТВ жұқтырған қан мен оның препараттарын құю кезінде, АИТВ жұқтырған адамның дене сұйықтықтарымен ластанған Медициналық және медициналық емес құралдарды қолданғанда болады. Сонымен қатар, трансплантация үшін қолданылатын донорлардың мүшелері мен тіндері қауіп төндіруі мүмкін. Вирус сілекей, тер, жас секілді дене сұйықтығы арқылы адамнан адамға берілмейді.\n",
    ),
    HIVArticle(
        header = "Аурудың жіктелуі",
        text = "1. Инкубация кезеңі-инфекция сәтінен бастап Жедел инфекцияның және/немесе антиденелердің (антигеннің, бұл жағдайда вирустың енуіне жауап ретінде өндірілетін арнайы ақуыздардың) клиникалық көріністері түрінде ағзаның реакциясы пайда болғанға дейін.\n" +
                "2. Клиникалық симптомдардың бастапқы көріністерінің кезеңі:\n" +
                "а) асимптоматикалық курс (симптомдар жоқ, антиденелер шығарылады);\n" +
                "б) қайталама ауруларсыз жедел АИТВ-инфекциясы: лимфа түйіндерінің ұлғаюы, температураның жоғарылауы, фарингит, теріде және шырышты қабаттарда бөртпелер, сирек-бауырдың, көкбауырдың ұлғаюы, диарея;\n" +
                "в) қайталама аурулары бар жіті АИТВ-инфекциясы (тамақ ауруы, бактериялық пневмония, кандидоз, герпес инфекциясы және т.б.). Бұл көріністер, әдетте, әлсіз, қысқа мерзімді, терапияға жауап береді.\n" +
                "3. Субклиникалық кезең – аурудың жалғыз клиникалық көрінісі-лимфа түйіндерінің ісінуі.\n" +
                "4. Қайталама аурулардың сатысы:\n" +
                "а) дене салмағының 10% - дан аз түсуі, тері мен шырышты қабықтың саңырауқұлақ, вирустық, бактериялық зақымдануы, қайталанатын фарингит, синусит;\n" +
                "б) дене салмағының 10% - дан астам түсуі, диарея немесе бір айдан астам қызба, қайталанатын тұрақты вирустық, бактериялық, саңырауқұлақ, протозой (қарапайымдылардан туындаған) ішкі ағзалардың зақымдануы, Капоши саркомасы (терідегі және шырышты қабаттардағы көптеген қатерлі ісіктер);\n" +
                "в) кахексия (әлсіреу), жалпыланған вирустық, бактериялық, саңырауқұлақтық, протозойлық, паразиттік аурулар, пневмоцисттік пневмония, туберкулез, қатерлі ісіктер, орталық жүйке жүйесінің зақымдануы. \n" +
                "5. Соңғы кезең-қайталама аурулар қайтымсыз сипатқа ие болады, өлім олардың дамуынан бірнеше ай ішінде болады.\n"
    ),
    HIVArticle(
        header = "АИТВ/ЖИТС белгілері",
        text = "Бірнеше күннен бірнеше аптаға дейінгі инкубациялық кезеңнен кейін жұқтырғандардың көпшілігінде тұмауға ұқсас белгілері бар жедел ауру пайда болады (дене температурасының жоғарылауы, ауырсыну, жалпы әлсіздік, тәбеттің болмауы, бас ауруы, тамақ ауруы, лимфа түйіндерінің ісінуі, тері бөртпелері). Салмақ жоғалту, ауыз қуысында жаралар пайда болуы мүмкін. Бұл кезең әдетте 7-10 күнге созылады. Көріністердің спецификалық диагстігіне байланысты \"АИТВ\" диагнозы сирек белгіленеді. Аурудың осы кезеңінде оппортунистік инфекциялар сирек кездеседі, қақырықпен жөтел, кеудедегі ауырсыну (пневмония дамыған кезде), терідегі көпіршікті бөртпелер (герпес зостерімен) байқалады. Әдетте, АИТВ-ны арнайы емдеусіз әл-ауқат тез қалыпқа келеді.\n" +
                "Осы кезеңнен кейін инфекциялық процесс пен оның дамуын тежейтін вирусқа қарсы иммунитет арасында уақытша тепе-теңдік орнатылады.\n" +
                "Ұзақ уақыт бойы (8-10 жыл немесе одан да көп) инфекция симптомсыз немесе тұрақты жалпыланған лимфаденопатиямен жүреді - кем дегенде 3 айға созылатын лимфа түйіндерінің кем дегенде екі тобының ұлғаюы.\n" +
                "Болашақта вирустың белсенді көбеюі және Т-лимфоциттердің жойылуы жалғасады, салмақтың үдемелі төмендеуімен, жалпы әлсіздікпен, температураның тұрақты көтерілуімен, қалтыраумен, қатты терлеумен сипатталатын қайталама өзгерістер кезеңі дамиды. Оппортунистік аурулардың клиникалық көріністері осы кезеңнің клиникалық көрінісін анықтайды: науқастар жөтел мен ентігу, жүрек айну, құсу, іштің ауыруы, ауыр диарея, терінің бөртпесі, қатты бас ауруы, есте сақтау мен зейіннің төмендеуі және т. б.\n"
    ),
    HIVArticle(
        header = "АИТВ диагностикасы",
        text = "Зертханалық зерттеу әдістері:\n" +
                "1.\tАИТВ скринингі.\n" +
                "2.\tАИТВ жұқтыру фактісін растайтын тексеру (скринингтің оң немесе күмәнді нәтижелері болған кезде).\n" +
                "3.\tАдам қанындағы вирустың мөлшерін өлшеу және бақылау - \"АИТВ\"диагнозы қойылған адамдарда вирустық жүктемені анықтау.\n" +
                "4.\tАИТВ-инфекциясы бар науқастардың иммундық жағдайын анықтау.\n" +
                "АИТВ-ға скрининг (сау адамдарды тексеру) жұқтырылуы мүмкін деп санайтын кез келген адамға, сондай-ақ кез келген ауруханаға жатқызу мен операция алдында барлық жүкті әйелдер мен олардың жыныстық серіктестеріне жүргізілуі керек.\n" +
                "АИТВ жұқтыру қаупі жоғары адамдарға, мысалы, АИТВ-инфекциясымен бірдей берілу механизмі бар аурулар (В және С вирустық гепатиттері, жыныстық жолмен берілетін аурулар), тұрақты қорғалмаған жыныстық қатынастары бар адамдарға, инъекциялық нашақорларға, АИТВ-инфекциясы бар аналардан туған балаларға, медициналық тексеруден өткен жөн. жұмыста қанмен тікелей байланыста болатын жұмысшыларға және т. б.\n" +
                "Үйде жасауға болатын АИТВ скринингіне арналған жедел тесттер бар. АИТВ-ға спецификалық антиденелерді/антигендерді (АИТВ-1, 2, p24 антигені) анықтау үшін қан, сілекей немесе зәр қолданылады. Кез-келген жедел сынақтың дәлдігі зертханада өткізілген сынақтан төмен.\n" +
                "Стандартты скринингтік тексеру үшін қандағы АИТВ 1 және 2 антиденелері және АИТВ 1 және 2 антигені (HIV Ag/Ab Combo) ферментке қарсы талдау (ИФА) арқылы анықталады.\n"
    ),


)