package com.saqtan.saqtan.data.model

/** хранит статьи из информационного раздела
 * */
data class HIVArticle(
    val header: String = "",
    val text: String = ""
)


val Articles: List<HIVArticle> = listOf(
    HIVArticle(
        header = "Аурудың анықтамасы",
        text = "АИТВ (адамның иммун тапшылығы вирусы) – жұқпалы созылмалы ауру, байланыс арқылы таралады, баяу үдемелі және жүре пайда болған иммун тапшылығы синдромының (ЖИТС) дамуымен иммундық жүйенің зақымдануымен сипатталады. ЖИТС-бұл АИТВ-инфекциясының соңғы кезеңі, иммундық жүйенің әлсіреуіне байланысты адам кез-келген инфекциядан және қатерлі ісіктің кейбір түрлерінен қорғансыз болады. Оппортунистік инфекциялар – патогенді немесе патогенді емес флора тудыратын аурулар: вирустар, бактериялар, саңырауқұлақтар, олар сау адамдарда ауыр зардаптарға әкелмейді немесе оңай өтеді және өздігінен емделеді. ЖИТС кезінде олар бір-бірінің үстіне қабаттасады, ұзаққа созылады, терапияға жақсы жауап қайтармайды және өлімге әкелуі мүмкін."
    ),
    HIVArticle(
        header = "АИТВ себептері",
        text = "Инфекция көзі-аурудың кез-келген кезеңінде АИТВ жұқтырған адам. Вирус қан, сперматозоидтар, қынаптың секретінен, емшек сүті арқылы беріледі.\n" +
                "Жыныстық жол (жұқтырған серіктеспен қорғалмаған жыныстық қатынас) АИТВ – инфекциясының таралуының басым факторы болып табылады.\n" +
                "АИТВ-ның анадан балаға берілуі жүктіліктің кез келген кезеңінде (плацента арқылы), босану кезінде (босану каналы арқылы өту кезінде) және емшек сүтімен (жаралар, ананың емізікшелерінде және баланың аузында жарықтар болған кезде) болуы мүмкін.\n" +
                "Инфекцияның жоғары қаупі стерильді емес шприцтермен есірткі заттарын көктамыр ішіне енгізгенде, АИТВ жұқтырған қан мен оның препараттарын құю кезінде, АИТВ жұқтырған адамның дене сұйықтықтарымен ластанған Медициналық және медициналық емес құралдарды қолданғанда болады. Сонымен қатар, трансплантация үшін қолданылатын донорлардың мүшелері мен тіндері қауіп төндіруі мүмкін. Вирус сілекей, тер, жас секілді дене сұйықтығы арқылы адамнан адамға берілмейді.\n",
    ),
    HIVArticle(
        header = "Аурудың жіктелуі",
        text = "1. Инкубация кезеңі-инфекция сәтінен бастап Жедел инфекцияның және/немесе антиденелердің (антигеннің, бұл жағдайда вирустың енуіне жауап ретінде өндірілетін арнайы ақуыздардың) клиникалық көріністері түрінде ағзаның реакциясы пайда болғанға дейін.\n" +
                "2. Клиникалық симптомдардың бастапқы көріністерінің кезеңі:\n" +
                "а) асимптоматикалық курс (симптомдар жоқ, антиденелер шығарылады);\n" +
                "б) қайталама ауруларсыз жедел АИТВ-инфекциясы: лимфа түйіндерінің ұлғаюы, температураның жоғарылауы, фарингит, теріде және шырышты қабаттарда бөртпелер, сирек-бауырдың, көкбауырдың ұлғаюы, диарея;\n" +
                "в) қайталама аурулары бар жіті АИТВ-инфекциясы (тамақ ауруы, бактериялық пневмония, кандидоз, герпес инфекциясы және т.б.). Бұл көріністер, әдетте, әлсіз, қысқа мерзімді, терапияға жауап береді.\n" +
                "3. Субклиникалық кезең – аурудың жалғыз клиникалық көрінісі-лимфа түйіндерінің ісінуі.\n" +
                "4. Қайталама аурулардың сатысы:\n" +
                "а) дене салмағының 10% - дан аз түсуі, тері мен шырышты қабықтың саңырауқұлақ, вирустық, бактериялық зақымдануы, қайталанатын фарингит, синусит;\n" +
                "б) дене салмағының 10% - дан астам түсуі, диарея немесе бір айдан астам қызба, қайталанатын тұрақты вирустық, бактериялық, саңырауқұлақ, протозой (қарапайымдылардан туындаған) ішкі ағзалардың зақымдануы, Капоши саркомасы (терідегі және шырышты қабаттардағы көптеген қатерлі ісіктер);\n" +
                "в) кахексия (әлсіреу), жалпыланған вирустық, бактериялық, саңырауқұлақтық, протозойлық, паразиттік аурулар, пневмоцисттік пневмония, туберкулез, қатерлі ісіктер, орталық жүйке жүйесінің зақымдануы. \n" +
                "5. Соңғы кезең-қайталама аурулар қайтымсыз сипатқа ие болады, өлім олардың дамуынан бірнеше ай ішінде болады.\n"
    ),
    HIVArticle(
        header = "АИТВ/ЖИТС белгілері",
        text = "Бірнеше күннен бірнеше аптаға дейінгі инкубациялық кезеңнен кейін жұқтырғандардың көпшілігінде тұмауға ұқсас белгілері бар жедел ауру пайда болады (дене температурасының жоғарылауы, ауырсыну, жалпы әлсіздік, тәбеттің болмауы, бас ауруы, тамақ ауруы, лимфа түйіндерінің ісінуі, тері бөртпелері). Салмақ жоғалту, ауыз қуысында жаралар пайда болуы мүмкін. Бұл кезең әдетте 7-10 күнге созылады. Көріністердің спецификалық диагстігіне байланысты \"АИТВ\" диагнозы сирек белгіленеді. Аурудың осы кезеңінде оппортунистік инфекциялар сирек кездеседі, қақырықпен жөтел, кеудедегі ауырсыну (пневмония дамыған кезде), терідегі көпіршікті бөртпелер (герпес зостерімен) байқалады. Әдетте, АИТВ-ны арнайы емдеусіз әл-ауқат тез қалыпқа келеді.\n" +
                "Осы кезеңнен кейін инфекциялық процесс пен оның дамуын тежейтін вирусқа қарсы иммунитет арасында уақытша тепе-теңдік орнатылады.\n" +
                "Ұзақ уақыт бойы (8-10 жыл немесе одан да көп) инфекция симптомсыз немесе тұрақты жалпыланған лимфаденопатиямен жүреді - кем дегенде 3 айға созылатын лимфа түйіндерінің кем дегенде екі тобының ұлғаюы.\n" +
                "Болашақта вирустың белсенді көбеюі және Т-лимфоциттердің жойылуы жалғасады, салмақтың үдемелі төмендеуімен, жалпы әлсіздікпен, температураның тұрақты көтерілуімен, қалтыраумен, қатты терлеумен сипатталатын қайталама өзгерістер кезеңі дамиды. Оппортунистік аурулардың клиникалық көріністері осы кезеңнің клиникалық көрінісін анықтайды: науқастар жөтел мен ентігу, жүрек айну, құсу, іштің ауыруы, ауыр диарея, терінің бөртпесі, қатты бас ауруы, есте сақтау мен зейіннің төмендеуі және т. б.\n"
    ),
    HIVArticle(
        header = "АИТВ диагностикасы",
        text = "Зертханалық зерттеу әдістері:\n" +
                "1.\tАИТВ скринингі.\n" +
                "2.\tАИТВ жұқтыру фактісін растайтын тексеру (скринингтің оң немесе күмәнді нәтижелері болған кезде).\n" +
                "3.\tАдам қанындағы вирустың мөлшерін өлшеу және бақылау - \"АИТВ\"диагнозы қойылған адамдарда вирустық жүктемені анықтау.\n" +
                "4.\tАИТВ-инфекциясы бар науқастардың иммундық жағдайын анықтау.\n" +
                "АИТВ-ға скрининг (сау адамдарды тексеру) жұқтырылуы мүмкін деп санайтын кез келген адамға, сондай-ақ кез келген ауруханаға жатқызу мен операция алдында барлық жүкті әйелдер мен олардың жыныстық серіктестеріне жүргізілуі керек.\n" +
                "АИТВ жұқтыру қаупі жоғары адамдарға, мысалы, АИТВ-инфекциясымен бірдей берілу механизмі бар аурулар (В және С вирустық гепатиттері, жыныстық жолмен берілетін аурулар), тұрақты қорғалмаған жыныстық қатынастары бар адамдарға, инъекциялық нашақорларға, АИТВ-инфекциясы бар аналардан туған балаларға, медициналық тексеруден өткен жөн. жұмыста қанмен тікелей байланыста болатын жұмысшыларға және т. б.\n" +
                "Үйде жасауға болатын АИТВ скринингіне арналған жедел тесттер бар. АИТВ-ға спецификалық антиденелерді/антигендерді (АИТВ-1, 2, p24 антигені) анықтау үшін қан, сілекей немесе зәр қолданылады. Кез-келген жедел сынақтың дәлдігі зертханада өткізілген сынақтан төмен.\n" +
                "Стандартты скринингтік тексеру үшін қандағы АИТВ 1 және 2 антиденелері және АИТВ 1 және 2 антигені (HIV Ag/Ab Combo) ферментке қарсы талдау (ИФА) арқылы анықталады.\n"
    ),
    HIVArticle(
        header = "Тең кеңесшілердің көмегі",
        text = "Мұндай жағдайды бастан өткерген адам ғана сезімдер мен туындаған мәселелерді түсіне алады деген пікір бар…\n" +
                "Облыстық ЖИТС орталығында тең консультанттар тобы жұмыс істейді. Емдеу көмек бөлімінде күн сайын жұмыс күндері сағат 9.00 - ден 15.00-ге дейін тең консультанттар жұмыс істейді. Тең кеңесші-бұл АИТВ-мен өмір сүретін, кеңес беру бойынша арнайы дайындықтан өткен және АИТВ-инфекциясының медициналық аспектілерін білетін адам. Біздің кеңесшілеріміз-АИТВ-мен өмір сүрудің әртүрлі тәжірибесі бар адамдар. Біреу өзінің ауруы туралы екі жылдан бері біледі, біреу АИТВ-мен 10 жылдан астам өмір сүріп келеді. Барлық тең кеңесшілер антиретровирустық терапияны қабылдайды-вирустың көбеюін бәсеңдететін емдеу, ұзақ өмір сүруге мүмкіндік беретін, Өмір сапасын жақсартатын дәрілер.\n" +
                "Тең кеңесшімен сөйлесу-бұл көмек және эмоционалды қолдау.\n"
    ),
    HIVArticle(
        header = "Өзара көмек тобы: бұл не үшін қажет?",
        text = "Қолдау және өзара көмек тобы-бұл мүшелер АИТВ-мен өмір сүру тәжірибесімен, проблемаларымен және оларды шешу жолдарымен бөлісе алатын орын. Топ АИТВ-ның болу фактісін қабылдауға, ол туралы ашық сөйлесуді үйренуге, емдеуге байланысты мәселелерді талқылауға көмектеседі. Бұл оқшаулану, жалғыздық сезімін азайту, моральдық қолдау мен ақпаратпен қамтамасыз ету арқылы белгілі бір топқа қатысқандардың жеке өмірін жақсарта алады.\n" +
                "Өзара көмек және қолдау тобы аптасына бір рет жексенбі күндері сағат 14.00-ден 18.00-ге дейін Қарағанды облыстық ЖИТС орталығында, Анжерская 37 мекенжайы бойынша, сондай-ақ Теміртау қаласында \"Шапағат\"қоғамдық бірлестігінде әр сенбі сайын сағат 13.00-ден 15.00-ге дейін, Республика даңғылы 26/2а мекенжайы бойынша өтеді.\n"
    ),
    HIVArticle(
        header = "Психологиялық көмек",
        text = "Егер Сізге немесе Сіздің жақындарыңызға АИТВ-инфекциясы мәселесі әсер етсе немесе АИТВ-инфекциясы диагнозы қойылса, диагнозыңызға бейімделуге және толыққанды өмір сүруді жалғастыруға көмектесетін осы ақпаратты оқыңыз.\n" +
                "АИТВ-ға талдаудың оң нәтижесін алғаннан кейін, адам қиылыста болуы мүмкін, басында барлық сұрақтар бар. Мысалы: мен отбасын құра аламын ба, дені сау бала туа аламын ба, қанша жыл өмір сүремін? немесе жұмысқа не болады? қалай өмір сүруге болады? жақындарыңызға қалай айтасыз? Барлық сұрақтарға бір минут ішінде жауап беру нәтиже бермейді! – көп нәрсені үйрену керек, көп нәрсені қайта қарау керек, әдеттегі өмірді жалғастыру үшін бір нәрсені өзгерту қажет болуы мүмкін.\n" +
                "Ол үшін ЖИТС орталығының мамандары арқылы, сондай – ақ инфекционист-дәрігердің, психологтың, әлеуметтік қызметкердің, медбикенің, тең консультанттың (АИТВ-мен өмір сүретін адам) жеке консультациясында сізді алаңдататын сұрақтарға шынайы жауаптар алу қажет.\n" +
                "АИТВ-инфекциясы-бұл кейбір адамдар үшін әдепсіз, қорқынышты, өлімге әкелетін ауру, бұл басқаларға айтуға ұят және өмір туралы ойлануға себеп... психологтар көптеген адамдар үшін АИТВ-инфекциясы диагнозын қою стресс, шок және маманның көмегі жиі қажет екенін атап өтті.\n" +
                "Стресстік жағдайдан оңай өтіп, қалпына келтірудің бірқатар жолдары бар. Олардың бірі-психолог пен психотерапевттің жеке кеңестері.\n" +
                "Облыстық ЖИТС орталығында инфекционист дәрігер, психолог, әлеуметтік қызметкер және тең кеңесші сияқты мамандар жұмыс істейді. Бұл мамандар сізбен бір немесе бірнеше құпия, жеке консультациялар өткізуге дайын. Пациенттің қалауы бойынша кездесулер саны, олардың жиілігі, сондай-ақ қажет болған жағдайда және пациенттің сұрауы бойынша туыстарының немесе серіктестерінің консультациясы айқындалады.\n" +
                "Сонымен қатар, сенім телефонында 44-15-50 (жұмыс күндері сағат 8.30-дан 18.00-ге дейін) сізді қызықтыратын мәселелер бойынша орталық мамандарынан кеңес алуға болады.\n" +
                "Біз пациенттерге ұзақ депрессиялық, мазасыздық және жүйке жағдайында психологқа жүгінуді ұсынамыз. Сенімді әңгіме, қолдау, сыртқы көзқарас, психологпен қызықты мәселелерді талқылау эмоционалды жағдайдың тұрақтануына және жағдайға оң көзқарасқа әкеледі.\n"
    )
)